# WallSweepOrientation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..WallSweepOrientation Property
WallSweepInfo Class See Also
---
Indicates how the profile of a horiztonal sweep is oriented with repect to the wall side face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public WallSweepOrientation WallSweepOrientation { get; set; }
```

Visual Basic
---
```text
Public Property WallSweepOrientation As WallSweepOrientation
	Get
	Set
```

Visual C++
---
```text
public:
property WallSweepOrientation WallSweepOrientation {
	WallSweepOrientation get ();
	void set (WallSweepOrientation value);
}
```

# ### Field Value
Allowed values are Horizontal and Perpendicular. Default is Perpendicular
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace